# CLI Tools
brew "tmux"
brew "neovim"
brew "git"
brew "stow"
brew "asdf"
brew "starship"

tap "leoafarias/fvm"
brew "fvm"

# Search & Navigation
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "direnv"

# Git & Productivity
brew "delta"
brew "gh"

# Utils
brew "coreutils"
brew "gnu-sed"
brew "jq"

# Databases
brew "postgresql@17"
brew "mysql"

# Neovim
brew "lua-language-server"
brew "stylua"
brew "swiftformat"
brew "xcode-build-server"
brew "xcbeautify"

# Development
brew "claude-code"
brew "docker"
brew "docker-desktop"

# Editors
cask "visual-studio-code"
cask "sublime-text"
cask "android-studio"

# Work
brew "notion"
brew "postman"

# ========================
# CASKS
# ========================
cask "wezterm"
cask "karabiner-elements"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
